const questions = [

    {
        question:
        "وفقًا للدستور التونسي، ما هي عاصمة الجمهورية التونسية؟",

        answers: [
            "صفاقس",
            "سوسة",
            "تونس",
            "بنزرت"
        ],

        correct: 2
    },

    {
        question:
        "ما هي اللغة الرسمية للجمهورية التونسية؟",

        answers: [
            "الفرنسية",
            "العربية",
            "الإنجليزية",
            "الإيطالية"
        ],

        correct: 1
    },

    {
        question:
        "ما هو الاسم الرسمي لمجموعة القواعد التي تنظم الالتزامات والعقود في تونس؟",

        answers: [
            "مجلة الالتزامات والعقود",
            "مجلة الأحوال الشخصية",
            "المجلة الجزائية",
            "مجلة الشغل"
        ],

        correct: 0
    },

    {
        question:
        "ما هي المجلة التي تنظم مسائل الزواج والطلاق والنسب في تونس؟",

        answers: [
            "المجلة الجزائية",
            "مجلة الشغل",
            "مجلة الأحوال الشخصية",
            "مجلة الالتزامات والعقود"
        ],

        correct: 2
    },

    {
        question:
        "ما هي الجهة التي تتولى الفصل في النزاعات وفق اختصاصها القضائي؟",

        answers: [
            "المحاكم",
            "البلديات",
            "الشركات",
            "الجمعيات"
        ],

        correct: 0
    },

    {
        question:
        "أي مجلة تتعلق أساسًا بالجرائم والعقوبات في تونس؟",

        answers: [
            "مجلة الشغل",
            "المجلة الجزائية",
            "مجلة التجارة",
            "مجلة الأحوال الشخصية"
        ],

        correct: 1
    },

    {
        question:
        "ما هو النص الذي ينظم أساسًا العلاقات الشغلية الفردية والجماعية في تونس؟",

        answers: [
            "مجلة الشغل",
            "المجلة الجزائية",
            "مجلة الأحوال الشخصية",
            "مجلة المرافعات"
        ],

        correct: 0
    },

    {
        question:
        "أي مجلة تنظم الإجراءات أمام المحاكم المدنية والتجارية؟",

        answers: [
            "مجلة المرافعات المدنية والتجارية",
            "مجلة الشغل",
            "المجلة الجزائية",
            "مجلة الأحوال الشخصية"
        ],

        correct: 0
    },

    {
        question:
        "ما المقصود بالعقد في مفهوم قانوني عام؟",

        answers: [
            "اتفاق ينشئ أو يعدل أو ينقل أو ينهي التزامات وفق القانون",
            "قرار إداري فقط",
            "حكم قضائي",
            "جريمة"
        ],

        correct: 0
    },

    {
        question:
        "ما هي إحدى شروط صحة الرضا في العقد؟",

        answers: [
            "أن يكون صادراً عن إرادة سليمة",
            "أن يكون سريًا دائمًا",
            "أن يكون شفهيًا دائمًا",
            "أن يكون صادرًا عن المحكمة"
        ],

        correct: 0
    }

];
